# encoding:utf-8
# i=float(input('利润:'))
# m=float()
# if 0<=i<=10.0:
#     print('你的奖金是：%f万'%(0.1*i))
# elif 0<=i<=20.0:
#     print('你的奖金是：%f万'%(1+0.075*(i-10.0)));
# elif 0<=i<=40.0:
#     print('你的奖金是：%f万'%(1.75+0.05*(i-20.0)))
# elif 0<=i<=60.0:
#     print('你的奖金是：%f万'%(2.75+0.03*(i-40.0)))
# elif 0<=i<=100.0:
#     print('你的奖金是：%f万'% (3.35+0.015*(i-60.0)))
# elif i>100:
#     print('你的奖金是：%f万'% (3.95+0.001*(i-100.0)))
# else:
#     print('输入有误')
#
# a=int(input('年份：'))
# # if a%4==0 and a%100!=0:
# #     print('普通闰年')
# # elif a%400==0:
# #     print('世纪闰年')
# # else:
#     print ('普通年')