#encoding:utf-8
# while True:
#     try:
#        a=float(input('请输入你的当月利润:'))
#        break
#     except:
#         print ('你的输入有误，请输入数字！')
# b=float()
# if 0<=a<=10.0:
#     print ('你的奖金数为:%f万'%(a*0.1))
# if 10.0 <a<=20.0:
#        print ('你的奖金数为:%f万' % (10.0* 0.1+(a-10.0)*0.075))
# if 20<a<=40.0:
#       print ('你的奖金数为:%f万' % (10.0* 0.1+10.0*0.075+(a-20.0)*0.05))
# if 40<a <= 60.0:
#       print ('你的奖金数为:%f万' % (10.0 * 0.1 + 10.0 * 0.075+20.0*0.05+(a-40.0)*0.03))
# if 60<a<=100.0:
#       print ('你的奖金数为:%f万' % (10.0* 0.1+10.0*0.075+20.0*0.05+20.0*0.03+(a-60.0)*0.015))
# if a>100:
#     print('你的奖金数为:%f万' % (10.0* 0.1+10.0*0.075+20.0*0.05+20.0*0.03+40.0*0.015+(a-100.0)*0.001))
# if a<0:
#     print ('你的输入有误')



while True:
    try:
       b=int(input('请输入年份:'))
       break
    except:
        print ('你输入的不是数字，请重新输入！')
if b%400==0:
   print ('%d是世纪闰年'%(b))
else:
    if b%4==0 and b%100!=0:
        print ('%d是普通闰年' % (b))
    else:
        print ('%d不是闰年' % (b))
